using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Entities.Models
{
    public static class Tags
    {
        public static Dictionary<string, List<string>> DicTags = new Dictionary<string, List<string>>()
{
    {"Туризм", new List<string>{ "подорожі", "відпустка", "готелі", "маршрути" } },
    {"Їжа", new List<string>{ "ресторани", "кухня", "місцева їжа", "дегустація" } },
    {"Природа", new List<string>{ "гори", "озера", "ліси", "національні парки" } },
    {"Шопінг", new List<string>{ "ринки", "торгові центри", "сувеніри", "бренди" } },
    {"Історія", new List<string>{ "музеї", "пам’ятки", "руїни", "фортеці" } },
    {"Спорт", new List<string>{ "футбол", "лижі", "велоспорт", "серфінг" } },
    {"Для дітей", new List<string>{ "атракціони", "парки", "зоопарк", "ігрові зони" } },
    {"Тихі місця", new List<string>{ "усамітнення", "релакс", "спокій", "медитація" } },
    {"Романтика", new List<string>{ "побачення", "захід сонця", "романтична вечеря", "прогулянка" } },
    {"Екзотика", new List<string>{ "джунглі", "пляжі", "традиції", "незвичні тварини" } },
    {"Екстрим", new List<string>{ "банджі", "параплан", "рафтинг", "скелелазіння" } },
    {"Розваги", new List<string>{ "нічне життя", "бари", "клуби", "концерти" } },
    {"Банк", new List<string>{ "обмін валют", "банкомати", "фінанси", "кредит" } },
    {"Місця поруч", new List<string>{ "локальні перлини", "вихідного дня", "сусіднє місто", "коротка поїздка" } },
    {"Архітектура", new List<string>{ "будівлі", "старовинні споруди", "модерн", "стилі" } },
    {"Цікаві місця", new List<string>{ "оглядові майданчики", "скульптури", "відомі вулиці", "унікальні пам’ятки" } }
};


    }
}
